[{"id":1,"chunk":"The Project Gutenberg eBook of Alice's Adventures in Wonderland\r\n    \r\nThis ebook is for the use of anyone anywhere in the United States and\r\nmost other parts of the world at no cost and with almost no restrictions\r\nwhatsoever. You may copy it, give it away or re-use it under the terms\r\nof the Proje"},{"id":2,"chunk":"ct Gutenberg License included with this ebook or online\r\nat www.gutenberg.org. If you are not located in the United States,\r\nyou will have to check the laws of the country where you are located\r\nbefore using this eBook.\r\n\r\nTitle: Alice's Adventures in Wonderland\r\n\r\nAuthor: Lewis Carroll\r\n\r\nIllustrat"},{"id":3,"chunk":"or: Gordon Robinson\r\n\r\nRelease date: August 12, 2006 [eBook #19033]\r\n                Most recently updated: July 3, 2025\r\n\r\nLanguage: English\r\n\r\nOriginal publication: Sam'l Gabriel Sons & Company New York\r\n\r\nCredits: Jason Isbell, Irma Spehar, and the Online Distributed Proofreading Team\r\n\r\n\r\n*** ST"},{"id":4,"chunk":"ART OF THE PROJECT GUTENBERG EBOOK ALICE'S ADVENTURES IN WONDERLAND ***\r\n          [Illustration: Alice in the Room of the Duchess.]\r\n\r\n\r\n                       _THE \"STORYLAND\" SERIES_\r\n\r\n\r\n\r\n                   ALICE'S ADVENTURES IN WONDERLAND\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n                     SAM'L GABRIEL SONS "},{"id":5,"chunk":"& COMPANY\r\n\r\n                               NEW YORK\r\n\r\n\r\n\r\n                           Copyright, 1916,\r\n\r\n                   by SAM'L GABRIEL SONS & COMPANY\r\n\r\n                               NEW YORK\r\n\r\n\r\n\r\n\r\nALICE'S ADVENTURES IN WONDERLAND\r\n\r\n[Illustration]\r\n\r\n\r\n\r\n\r\nI--DOWN THE RABBIT-HOLE\r\n\r\n\r\nA"},{"id":6,"chunk":"lice was beginning to get very tired of sitting by her sister on the\r\nbank, and of having nothing to do. Once or twice she had peeped into the\r\nbook her sister was reading, but it had no pictures or conversations in\r\nit, \"and what is the use of a book,\" thought Alice, \"without pictures or\r\nconversat"},{"id":7,"chunk":"ions?\"\r\n\r\nSo she was considering in her own mind (as well as she could, for the\r\nday made her feel very sleepy and stupid), whether the pleasure of\r\nmaking a daisy-chain would be worth the trouble of getting up and\r\npicking the daisies, when suddenly a White Rabbit with pink eyes ran\r\nclose by her.\r"},{"id":8,"chunk":"\n\r\nThere was nothing so very remarkable in that, nor did Alice think it so\r\nvery much out of the way to hear the Rabbit say to itself, \"Oh dear! Oh\r\ndear! I shall be too late!\" But when the Rabbit actually took a watch\r\nout of its waistcoat-pocket and looked at it and then hurried on, Alice\r\nstarted"},{"id":9,"chunk":" to her feet, for it flashed across her mind that she had never\r\nbefore seen a rabbit with either a waistcoat-pocket, or a watch to take\r\nout of it, and, burning with curiosity, she ran across the field after\r\nit and was just in time to see it pop down a large rabbit-hole, under\r\nthe hedge. In anoth"},{"id":10,"chunk":"er moment, down went Alice after it!\r\n\r\n[Illustration]\r\n\r\nThe rabbit-hole went straight on like a tunnel for some way and then\r\ndipped suddenly down, so suddenly that Alice had not a moment to think\r\nabout stopping herself before she found herself falling down what seemed\r\nto be a very deep well.\r\n\r"},{"id":11,"chunk":"\nEither the well was very deep, or she fell very slowly, for she had\r\nplenty of time, as she went down, to look about her. First, she tried to\r\nmake out what she was coming to, but it was too dark to see anything;\r\nthen she looked at the sides of the well and noticed that they were\r\nfilled with cupb"},{"id":12,"chunk":"oards and book-shelves; here and there she saw maps and\r\npictures hung upon pegs. She took down a jar from one of the shelves as\r\nshe passed. It was labeled \"ORANGE MARMALADE,\" but, to her great\r\ndisappointment, it was empty; she did not like to drop the jar, so\r\nmanaged to put it into one of the cu"},{"id":13,"chunk":"pboards as she fell past it.\r\n\r\nDown, down, down! Would the fall never come to an end? There was nothing\r\nelse to do, so Alice soon began talking to herself. \"Dinah'll miss me\r\nvery much to-night, I should think!\" (Dinah was the cat.) \"I hope\r\nthey'll remember her saucer of milk at tea-time. Dinah, "},{"id":14,"chunk":"my dear, I wish\r\nyou were down here with me!\" Alice felt that she was dozing off, when\r\nsuddenly, thump! thump! down she came upon a heap of sticks and dry\r\nleaves, and the fall was over.\r\n\r\nAlice was not a bit hurt, and she jumped up in a moment. She looked up,\r\nbut it was all dark overhead; before"},{"id":15,"chunk":" her was another long passage and\r\nthe White Rabbit was still in sight, hurrying down it. There was not a\r\nmoment to be lost. Away went Alice like the wind and was just in time to\r\nhear it say, as it turned a corner, \"Oh, my ears and whiskers, how late\r\nit's getting!\" She was close behind it when sh"},{"id":16,"chunk":"e turned the corner, but\r\nthe Rabbit was no longer to be seen.\r\n\r\nShe found herself in a long, low hall, which was lit up by a row of\r\nlamps hanging from the roof. There were doors all 'round the hall, but\r\nthey were all locked; and when Alice had been all the way down one side\r\nand up the other, tr"},{"id":17,"chunk":"ying every door, she walked sadly down the middle,\r\nwondering how she was ever to get out again.\r\n\r\nSuddenly she came upon a little table, all made of solid glass. There\r\nwas nothing on it but a tiny golden key, and Alice's first idea was that\r\nthis might belong to one of the doors of the hall; but,"},{"id":18,"chunk":" alas! either the\r\nlocks were too large, or the key was too small, but, at any rate, it\r\nwould not open any of them. However, on the second time 'round, she came\r\nupon a low curtain she had not noticed before, and behind it was a\r\nlittle door about fifteen inches high. She tried the little golden ke"},{"id":19,"chunk":"y\r\nin the lock, and to her great delight, it fitted!\r\n\r\n[Illustration]\r\n\r\nAlice opened the door and found that it led into a small passage, not\r\nmuch larger than a rat-hole; she knelt down and looked along the passage\r\ninto the loveliest garden you ever saw. How she longed to get out of\r\nthat dark h"},{"id":20,"chunk":"all and wander about among those beds of bright flowers and\r\nthose cool fountains, but she could not even get her head through the\r\ndoorway. \"Oh,\" said Alice, \"how I wish I could shut up like a telescope!\r\nI think I could, if I only knew how to begin.\"\r\n\r\nAlice went back to the table, half hoping sh"},{"id":21,"chunk":"e might find another key on\r\nit, or at any rate, a book of rules for shutting people up like\r\ntelescopes. This time she found a little bottle on it (\"which certainly\r\nwas not here before,\" said Alice), and tied 'round the neck of the\r\nbottle was a paper label, with the words \"DRINK ME\" beautifully p"},{"id":22,"chunk":"rinted\r\non it in large letters.\r\n\r\n\"No, I'll look first,\" she said, \"and see whether it's marked '_poison_'\r\nor not,\" for she had never forgotten that, if you drink from a bottle\r\nmarked \"poison,\" it is almost certain to disagree with you, sooner or\r\nlater. However, this bottle was _not_ marked \"poi"},{"id":23,"chunk":"son,\" so Alice ventured\r\nto taste it, and, finding it very nice (it had a sort of mixed flavor of\r\ncherry-tart, custard, pineapple, roast turkey, toffy and hot buttered\r\ntoast), she very soon finished it off.\r\n\r\n       *       *       *       *       *\r\n\r\n\"What a curious feeling!\" said Alice. \"I mus"},{"id":24,"chunk":"t be shutting up like a\r\ntelescope!\"\r\n\r\nAnd so it was indeed! She was now only ten inches high, and her face\r\nbrightened up at the thought that she was now the right size for going\r\nthrough the little door into that lovely garden.\r\n\r\nAfter awhile, finding that nothing more happened, she decided on g"},{"id":25,"chunk":"oing\r\ninto the garden at once; but, alas for poor Alice! When she got to the\r\ndoor, she found she had forgotten the little golden key, and when she\r\nwent back to the table for it, she found she could not possibly reach\r\nit: she could see it quite plainly through the glass and she tried her\r\nbest to "},{"id":26,"chunk":"climb up one of the legs of the table, but it was too slippery,\r\nand when she had tired herself out with trying, the poor little thing\r\nsat down and cried.\r\n\r\n\"Come, there's no use in crying like that!\" said Alice to herself rather\r\nsharply. \"I advise you to leave off this minute!\" She generally gav"},{"id":27,"chunk":"e\r\nherself very good advice (though she very seldom followed it), and\r\nsometimes she scolded herself so severely as to bring tears into her\r\neyes.\r\n\r\nSoon her eye fell on a little glass box that was lying under the table:\r\nshe opened it and found in it a very small cake, on which the words \"EAT\r\nME\""},{"id":28,"chunk":" were beautifully marked in currants. \"Well, I'll eat it,\" said\r\nAlice, \"and if it makes me grow larger, I can reach the key; and if it\r\nmakes me grow smaller, I can creep under the door: so either way I'll\r\nget into the garden, and I don't care which happens!\"\r\n\r\nShe ate a little bit and said anxio"},{"id":29,"chunk":"usly to herself, \"Which way? Which\r\nway?\" holding her hand on the top of her head to feel which way she was\r\ngrowing; and she was quite surprised to find that she remained the same\r\nsize. So she set to work and very soon finished off the cake.\r\n\r\n[Illustration]\r\n\r\n\r\n\r\n\r\nII--THE POOL OF TEARS\r\n\r\n\r\n\"C"},{"id":30,"chunk":"uriouser and curiouser!\" cried Alice (she was so much surprised that\r\nfor the moment she quite forgot how to speak good English). \"Now I'm\r\nopening out like the largest telescope that ever was! Good-by, feet! Oh,\r\nmy poor little feet, I wonder who will put on your shoes and stockings\r\nfor you now, d"},{"id":31,"chunk":"ears? I shall be a great deal too far off to trouble\r\nmyself about you.\"\r\n\r\nJust at this moment her head struck against the roof of the hall; in\r\nfact, she was now rather more than nine feet high, and she at once took\r\nup the little golden key and hurried off to the garden door.\r\n\r\nPoor Alice! It wa"},{"id":32,"chunk":"s as much as she could do, lying down on one side, to\r\nlook through into the garden with one eye; but to get through was more\r\nhopeless than ever. She sat down and began to cry again.\r\n\r\nShe went on shedding gallons of tears, until there was a large pool all\r\n'round her and reaching half down the ha"},{"id":33,"chunk":"ll.\r\n\r\nAfter a time, she heard a little pattering of feet in the distance and\r\nshe hastily dried her eyes to see what was coming. It was the White\r\nRabbit returning, splendidly dressed, with a pair of white kid-gloves in\r\none hand and a large fan in the other. He came trotting along in a\r\ngreat hurr"},{"id":34,"chunk":"y, muttering to himself, \"Oh! the Duchess, the Duchess! Oh!\r\n_won't_ she be savage if I've kept her waiting!\"\r\n\r\nWhen the Rabbit came near her, Alice began, in a low, timid voice, \"If\r\nyou please, sir--\" The Rabbit started violently, dropped the white\r\nkid-gloves and the fan and skurried away into t"},{"id":35,"chunk":"he darkness as hard as he\r\ncould go.\r\n\r\n[Illustration]\r\n\r\nAlice took up the fan and gloves and she kept fanning herself all the\r\ntime she went on talking. \"Dear, dear! How queer everything is to-day!\r\nAnd yesterday things went on just as usual. _Was_ I the same when I got\r\nup this morning? But if I'"},{"id":36,"chunk":"m not the same, the next question is, 'Who in\r\nthe world am I?' Ah, _that's_ the great puzzle!\"\r\n\r\nAs she said this, she looked down at her hands and was surprised to see\r\nthat she had put on one of the Rabbit's little white kid-gloves while\r\nshe was talking. \"How _can_ I have done that?\" she though"},{"id":37,"chunk":"t. \"I must be\r\ngrowing small again.\" She got up and went to the table to measure\r\nherself by it and found that she was now about two feet high and was\r\ngoing on shrinking rapidly. She soon found out that the cause of this\r\nwas the fan she was holding and she dropped it hastily, just in time to\r\nsave"},{"id":38,"chunk":" herself from shrinking away altogether.\r\n\r\n\"That _was_ a narrow escape!\" said Alice, a good deal frightened at the\r\nsudden change, but very glad to find herself still in existence. \"And\r\nnow for the garden!\" And she ran with all speed back to the little door;\r\nbut, alas! the little door was shut ag"},{"id":39,"chunk":"ain and the little golden key was\r\nlying on the glass table as before. \"Things are worse than ever,\"\r\nthought the poor child, \"for I never was so small as this before,\r\nnever!\"\r\n\r\nAs she said these words, her foot slipped, and in another moment,\r\nsplash! she was up to her chin in salt-water. Her fir"},{"id":40,"chunk":"st idea was that\r\nshe had somehow fallen into the sea. However, she soon made out that she\r\nwas in the pool of tears which she had wept when she was nine feet high.\r\n\r\n[Illustration]\r\n\r\nJust then she heard something splashing about in the pool a little way\r\noff, and she swam nearer to see what it wa"},{"id":41,"chunk":"s: she soon made out that it\r\nwas only a mouse that had slipped in like herself.\r\n\r\n\"Would it be of any use, now,\" thought Alice, \"to speak to this mouse?\r\nEverything is so out-of-the-way down here that I should think very\r\nlikely it can talk; at any rate, there's no harm in trying.\" So she\r\nbegan, "},{"id":42,"chunk":"\"O Mouse, do you know the way out of this pool? I am very tired\r\nof swimming about here, O Mouse!\" The Mouse looked at her rather\r\ninquisitively and seemed to her to wink with one of its little eyes, but\r\nit said nothing.\r\n\r\n\"Perhaps it doesn't understand English,\" thought Alice. \"I dare say it's\r\na"},{"id":43,"chunk":" French mouse, come over with William the Conqueror.\" So she began\r\nagain: \"Où est ma chatte?\" which was the first sentence in her French\r\nlesson-book. The Mouse gave a sudden leap out of the water and seemed to\r\nquiver all over with fright. \"Oh, I beg your pardon!\" cried Alice\r\nhastily, afraid that"},{"id":44,"chunk":" she had hurt the poor animal's feelings. \"I quite\r\nforgot you didn't like cats.\"\r\n\r\n\"Not like cats!\" cried the Mouse in a shrill, passionate voice. \"Would\r\n_you_ like cats, if you were me?\"\r\n\r\n\"Well, perhaps not,\" said Alice in a soothing tone; \"don't be angry\r\nabout it. And yet I wish I could show"},{"id":45,"chunk":" you our cat Dinah. I think you'd\r\ntake a fancy to cats, if you could only see her. She is such a dear,\r\nquiet thing.\" The Mouse was bristling all over and she felt certain it\r\nmust be really offended. \"We won't talk about her any more, if you'd\r\nrather not.\"\r\n\r\n\"We, indeed!\" cried the Mouse, who wa"},{"id":46,"chunk":"s trembling down to the end of its\r\ntail. \"As if _I_ would talk on such a subject! Our family always _hated_\r\ncats--nasty, low, vulgar things! Don't let me hear the name again!\"\r\n\r\n[Illustration: Alice at the Mad Tea Party.]\r\n\r\n\"I won't indeed!\" said Alice, in a great hurry to change the subject of\r"},{"id":47,"chunk":"\nconversation. \"Are you--are you fond--of--of dogs? There is such a nice\r\nlittle dog near our house, I should like to show you! It kills all the\r\nrats and--oh, dear!\" cried Alice in a sorrowful tone. \"I'm afraid I've\r\noffended it again!\" For the Mouse was swimming away from her as hard as\r\nit could "},{"id":48,"chunk":"go, and making quite a commotion in the pool as it went.\r\n\r\nSo she called softly after it, \"Mouse dear! Do come back again, and we\r\nwon't talk about cats, or dogs either, if you don't like them!\" When the\r\nMouse heard this, it turned 'round and swam slowly back to her; its face\r\nwas quite pale, and "},{"id":49,"chunk":"it said, in a low, trembling voice, \"Let us get to\r\nthe shore and then I'll tell you my history and you'll understand why it\r\nis I hate cats and dogs.\"\r\n\r\nIt was high time to go, for the pool was getting quite crowded with the\r\nbirds and animals that had fallen into it; there were a Duck and a Dodo,"},{"id":50,"chunk":"\r\na Lory and an Eaglet, and several other curious creatures. Alice led the\r\nway and the whole party swam to the shore.\r\n\r\n[Illustration]\r\n\r\n\r\n\r\n\r\nIII--A CAUCUS-RACE AND A LONG TALE\r\n\r\n\r\nThey were indeed a queer-looking party that assembled on the bank--the\r\nbirds with draggled feathers, the animals "},{"id":51,"chunk":"with their fur clinging close\r\nto them, and all dripping wet, cross and uncomfortable.\r\n\r\n[Illustration]\r\n\r\nThe first question, of course, was how to get dry again. They had a\r\nconsultation about this and after a few minutes, it seemed quite natural\r\nto Alice to find herself talking familiarly with "},{"id":52,"chunk":"them, as if she had\r\nknown them all her life.\r\n\r\nAt last the Mouse, who seemed to be a person of some authority among\r\nthem, called out, \"Sit down, all of you, and listen to me! _I'll_ soon\r\nmake you dry enough!\" They all sat down at once, in a large ring, with\r\nthe Mouse in the middle.\r\n\r\n\"Ahem!\" s"},{"id":53,"chunk":"aid the Mouse with an important air. \"Are you all ready? This\r\nis the driest thing I know. Silence all 'round, if you please! 'William\r\nthe Conqueror, whose cause was favored by the pope, was soon submitted\r\nto by the English, who wanted leaders, and had been of late much\r\naccustomed to usurpation a"},{"id":54,"chunk":"nd conquest. Edwin and Morcar, the Earls of\r\nMercia and Northumbria'--\"\r\n\r\n\"Ugh!\" said the Lory, with a shiver.\r\n\r\n\"--'And even Stigand, the patriotic archbishop of Canterbury, found it\r\nadvisable'--\"\r\n\r\n\"Found _what_?\" said the Duck.\r\n\r\n\"Found _it_,\" the Mouse replied rather crossly; \"of course, yo"},{"id":55,"chunk":"u know\r\nwhat 'it' means.\"\r\n\r\n\"I know what 'it' means well enough, when _I_ find a thing,\" said the\r\nDuck; \"it's generally a frog or a worm. The question is, what did the\r\narchbishop find?\"\r\n\r\nThe Mouse did not notice this question, but hurriedly went on, \"'--found\r\nit advisable to go with Edgar Athe"},{"id":56,"chunk":"ling to meet William and offer him the\r\ncrown.'--How are you getting on now, my dear?\" it continued, turning to\r\nAlice as it spoke.\r\n\r\n\"As wet as ever,\" said Alice in a melancholy tone; \"it doesn't seem to\r\ndry me at all.\"\r\n\r\n\"In that case,\" said the Dodo solemnly, rising to its feet, \"I move that\r\n"},{"id":57,"chunk":"the meeting adjourn, for the immediate adoption of more energetic\r\nremedies--\"\r\n\r\n\"Speak English!\" said the Eaglet. \"I don't know the meaning of half\r\nthose long words, and, what's more, I don't believe you do either!\"\r\n\r\n\"What I was going to say,\" said the Dodo in an offended tone, \"is that\r\nthe be"},{"id":58,"chunk":"st thing to get us dry would be a Caucus-race.\"\r\n\r\n\"What _is_ a Caucus-race?\" said Alice.\r\n\r\n[Illustration]\r\n\r\n\"Why,\" said the Dodo, \"the best way to explain it is to do it.\" First it\r\nmarked out a race-course, in a sort of circle, and then all the party\r\nwere placed along the course, here and there"},{"id":59,"chunk":". There was no \"One, two,\r\nthree and away!\" but they began running when they liked and left off\r\nwhen they liked, so that it was not easy to know when the race was over.\r\nHowever, when they had been running half an hour or so and were quite\r\ndry again, the Dodo suddenly called out, \"The race is over"},{"id":60,"chunk":"!\" and they\r\nall crowded 'round it, panting and asking, \"But who has won?\"\r\n\r\nThis question the Dodo could not answer without a great deal of thought.\r\nAt last it said, \"_Everybody_ has won, and _all_ must have prizes.\"\r\n\r\n\"But who is to give the prizes?\" quite a chorus of voices asked.\r\n\r\n\"Why, _sh"},{"id":61,"chunk":"e_, of course,\" said the Dodo, pointing to Alice with one\r\nfinger; and the whole party at once crowded 'round her, calling out, in\r\na confused way, \"Prizes! Prizes!\"\r\n\r\nAlice had no idea what to do, and in despair she put her hand into her\r\npocket and pulled out a box of comfits (luckily the salt-wa"},{"id":62,"chunk":"ter had not\r\ngot into it) and handed them 'round as prizes. There was exactly one\r\na-piece, all 'round.\r\n\r\nThe next thing was to eat the comfits; this caused some noise and\r\nconfusion, as the large birds complained that they could not taste\r\ntheirs, and the small ones choked and had to be patted on "},{"id":63,"chunk":"the back.\r\nHowever, it was over at last and they sat down again in a ring and\r\nbegged the Mouse to tell them something more.\r\n\r\n\"You promised to tell me your history, you know,\" said Alice, \"and why\r\nit is you hate--C and D,\" she added in a whisper, half afraid that it\r\nwould be offended again.\r\n\r\n\""},{"id":64,"chunk":"Mine is a long and a sad tale!\" said the Mouse, turning to Alice and\r\nsighing.\r\n\r\n\"It _is_ a long tail, certainly,\" said Alice, looking down with wonder\r\nat the Mouse's tail, \"but why do you call it sad?\" And she kept on\r\npuzzling about it while the Mouse was speaking, so that her idea of the\r\ntale "},{"id":65,"chunk":"was something like this:--\r\n\r\n    \"Fury said to\r\n      a mouse, That\r\n         he met in the\r\n            house, 'Let\r\n              us both go\r\n                to law: _I_\r\n                 will prosecute\r\n               _you_.--\r\n                 Come, I'll\r\n              take no denial:\r\n        "},{"id":66,"chunk":"     We\r\n           must have\r\n        the trial;\r\n     For really\r\n    this morning\r\n    I've\r\n    nothing\r\n    to do.'\r\n    Said the\r\n     mouse to\r\n      the cur,\r\n       'Such a\r\n        trial, dear\r\n           sir, With\r\n               no jury\r\n                or judge,\r\n                   woul"},{"id":67,"chunk":"d\r\n                  be wasting\r\n                our\r\n             breath.'\r\n         'I'll be\r\n        judge,\r\n       I'll be\r\n      jury,'\r\n     said\r\n    cunning\r\n    old\r\n     Fury;\r\n      'I'll\r\n       try\r\n        the\r\n         whole\r\n          cause,\r\n          and\r\n         condemn\r\n       y"},{"id":68,"chunk":"ou to\r\n    death.'\"\r\n\r\n\"You are not attending!\" said the Mouse to Alice, severely. \"What are\r\nyou thinking of?\"\r\n\r\n\"I beg your pardon,\" said Alice very humbly, \"you had got to the fifth\r\nbend, I think?\"\r\n\r\n\"You insult me by talking such nonsense!\" said the Mouse, getting up and\r\nwalking away.\r\n\r\n\"Pl"},{"id":69,"chunk":"ease come back and finish your story!\" Alice called after it. And the\r\nothers all joined in chorus, \"Yes, please do!\" But the Mouse only shook\r\nits head impatiently and walked a little quicker.\r\n\r\n\"I wish I had Dinah, our cat, here!\" said Alice. This caused a\r\nremarkable sensation among the party. S"},{"id":70,"chunk":"ome of the birds hurried off at\r\nonce, and a Canary called out in a trembling voice, to its children,\r\n\"Come away, my dears! It's high time you were all in bed!\" On various\r\npretexts they all moved off and Alice was soon left alone.\r\n\r\n\"I wish I hadn't mentioned Dinah! Nobody seems to like her down "},{"id":71,"chunk":"here and\r\nI'm sure she's the best cat in the world!\" Poor Alice began to cry\r\nagain, for she felt very lonely and low-spirited. In a little while,\r\nhowever, she again heard a little pattering of footsteps in the distance\r\nand she looked up eagerly.\r\n\r\n[Illustration]\r\n\r\n[Illustration]\r\n\r\n\r\n\r\n\r\nIV--TH"},{"id":72,"chunk":"E RABBIT SENDS IN A LITTLE BILL\r\n\r\n\r\nIt was the White Rabbit, trotting slowly back again and looking\r\nanxiously about as it went, as if it had lost something; Alice heard it\r\nmuttering to itself, \"The Duchess! The Duchess! Oh, my dear paws! Oh, my\r\nfur and whiskers! She'll get me executed, as sure a"},{"id":73,"chunk":"s ferrets are\r\nferrets! Where _can_ I have dropped them, I wonder?\" Alice guessed in a\r\nmoment that it was looking for the fan and the pair of white kid-gloves\r\nand she very good-naturedly began hunting about for them, but they were\r\nnowhere to be seen--everything seemed to have changed since her sw"},{"id":74,"chunk":"im in\r\nthe pool, and the great hall, with the glass table and the little door,\r\nhad vanished completely.\r\n\r\nVery soon the Rabbit noticed Alice, and called to her, in an angry tone,\r\n\"Why, Mary Ann, what _are_ you doing out here? Run home this moment and\r\nfetch me a pair of gloves and a fan! Quick, n"},{"id":75,"chunk":"ow!\"\r\n\r\n\"He took me for his housemaid!\" said Alice, as she ran off. \"How\r\nsurprised he'll be when he finds out who I am!\" As she said this, she\r\ncame upon a neat little house, on the door of which was a bright brass\r\nplate with the name \"W. RABBIT\" engraved upon it. She went in without\r\nknocking and"},{"id":76,"chunk":" hurried upstairs, in great fear lest she should meet the\r\nreal Mary Ann and be turned out of the house before she had found the\r\nfan and gloves.\r\n\r\nBy this time, Alice had found her way into a tidy little room with a\r\ntable in the window, and on it a fan and two or three pairs of tiny\r\nwhite kid-gl"},{"id":77,"chunk":"oves; she took up the fan and a pair of the gloves and was\r\njust going to leave the room, when her eyes fell upon a little bottle\r\nthat stood near the looking-glass. She uncorked it and put it to her\r\nlips, saying to herself, \"I do hope it'll make me grow large again, for,\r\nreally, I'm quite tired o"},{"id":78,"chunk":"f being such a tiny little thing!\"\r\n\r\nBefore she had drunk half the bottle, she found her head pressing\r\nagainst the ceiling, and had to stoop to save her neck from being\r\nbroken. She hastily put down the bottle, remarking, \"That's quite\r\nenough--I hope I sha'n't grow any more.\"\r\n\r\nAlas! It was too "},{"id":79,"chunk":"late to wish that! She went on growing and growing and\r\nvery soon she had to kneel down on the floor. Still she went on growing,\r\nand, as a last resource, she put one arm out of the window and one foot\r\nup the chimney, and said to herself, \"Now I can do no more, whatever\r\nhappens. What _will_ become"},{"id":80,"chunk":" of me?\"\r\n\r\n[Illustration]\r\n\r\nLuckily for Alice, the little magic bottle had now had its full effect\r\nand she grew no larger. After a few minutes she heard a voice outside\r\nand stopped to listen.\r\n\r\n\"Mary Ann! Mary Ann!\" said the voice. \"Fetch me my gloves this moment!\"\r\nThen came a little pattering"},{"id":81,"chunk":" of feet on the stairs. Alice knew it was\r\nthe Rabbit coming to look for her and she trembled till she shook the\r\nhouse, quite forgetting that she was now about a thousand times as large\r\nas the Rabbit and had no reason to be afraid of it.\r\n\r\nPresently the Rabbit came up to the door and tried to ope"},{"id":82,"chunk":"n it; but as\r\nthe door opened inwards and Alice's elbow was pressed hard against it,\r\nthat attempt proved a failure. Alice heard it say to itself, \"Then I'll\r\ngo 'round and get in at the window.\"\r\n\r\n\"_That_ you won't!\" thought Alice; and after waiting till she fancied\r\nshe heard the Rabbit just unde"},{"id":83,"chunk":"r the window, she suddenly spread out her\r\nhand and made a snatch in the air. She did not get hold of anything,\r\nbut she heard a little shriek and a fall and a crash of broken glass,\r\nfrom which she concluded that it was just possible it had fallen into a\r\ncucumber-frame or something of that sort.\r\n"},{"id":84,"chunk":"\r\nNext came an angry voice--the Rabbit's--\"Pat! Pat! Where are you?\" And\r\nthen a voice she had never heard before, \"Sure then, I'm here! Digging\r\nfor apples, yer honor!\"\r\n\r\n\"Here! Come and help me out of this! Now tell me, Pat, what's that in\r\nthe window?\"\r\n\r\n\"Sure, it's an arm, yer honor!\"\r\n\r\n\"Well"},{"id":85,"chunk":", it's got no business there, at any rate; go and take it away!\"\r\n\r\nThere was a long silence after this and Alice could only hear whispers\r\nnow and then, and at last she spread out her hand again and made another\r\nsnatch in the air. This time there were _two_ little shrieks and more\r\nsounds of broke"},{"id":86,"chunk":"n glass. \"I wonder what they'll do next!\" thought Alice.\r\n\"As for pulling me out of the window, I only wish they _could_!\"\r\n\r\nShe waited for some time without hearing anything more. At last came a\r\nrumbling of little cart-wheels and the sound of a good many voices all\r\ntalking together. She made out"},{"id":87,"chunk":" the words: \"Where's the other ladder?\r\nBill's got the other--Bill! Here, Bill! Will the roof bear?--Who's to go\r\ndown the chimney?--Nay, _I_ sha'n't! _You_ do it! Here, Bill! The master\r\nsays you've got to go down the chimney!\"\r\n\r\nAlice drew her foot as far down the chimney as she could and waited "},{"id":88,"chunk":"till\r\nshe heard a little animal scratching and scrambling about in the chimney\r\nclose above her; then she gave one sharp kick and waited to see what\r\nwould happen next.\r\n\r\nThe first thing she heard was a general chorus of \"There goes Bill!\"\r\nthen the Rabbit's voice alone--\"Catch him, you by the hedg"},{"id":89,"chunk":"e!\" Then\r\nsilence and then another confusion of voices--\"Hold up his head--Brandy\r\nnow--Don't choke him--What happened to you?\"\r\n\r\nLast came a little feeble, squeaking voice, \"Well, I hardly know--No\r\nmore, thank ye. I'm better now--all I know is, something comes at me\r\nlike a Jack-in-the-box and up"},{"id":90,"chunk":" I goes like a sky-rocket!\"\r\n\r\nAfter a minute or two of silence, they began moving about again, and\r\nAlice heard the Rabbit say, \"A barrowful will do, to begin with.\"\r\n\r\n\"A barrowful of _what_?\" thought Alice. But she had not long to doubt,\r\nfor the next moment a shower of little pebbles came rattli"},{"id":91,"chunk":"ng in at the\r\nwindow and some of them hit her in the face. Alice noticed, with some\r\nsurprise, that the pebbles were all turning into little cakes as they\r\nlay on the floor and a bright idea came into her head. \"If I eat one of\r\nthese cakes,\" she thought, \"it's sure to make _some_ change in my size."},{"id":92,"chunk":"\"\r\n\r\nSo she swallowed one of the cakes and was delighted to find that she\r\nbegan shrinking directly. As soon as she was small enough to get through\r\nthe door, she ran out of the house and found quite a crowd of little\r\nanimals and birds waiting outside. They all made a rush at Alice the\r\nmoment she "},{"id":93,"chunk":"appeared, but she ran off as hard as she could and soon found\r\nherself safe in a thick wood.\r\n\r\n[Illustration: \"The Duchess tucked her arm affectionately into\r\nAlice's.\"]\r\n\r\n\"The first thing I've got to do,\" said Alice to herself, as she\r\nwandered about in the wood, \"is to grow to my right size agai"},{"id":94,"chunk":"n; and the\r\nsecond thing is to find my way into that lovely garden. I suppose I\r\nought to eat or drink something or other, but the great question is\r\n'What?'\"\r\n\r\nAlice looked all around her at the flowers and the blades of grass, but\r\nshe could not see anything that looked like the right thing to ea"},{"id":95,"chunk":"t or\r\ndrink under the circumstances. There was a large mushroom growing near\r\nher, about the same height as herself. She stretched herself up on\r\ntiptoe and peeped over the edge and her eyes immediately met those of a\r\nlarge blue caterpillar, that was sitting on the top, with its arms\r\nfolded, quiet"},{"id":96,"chunk":"ly smoking a long hookah and taking not the smallest notice\r\nof her or of anything else.\r\n\r\n[Illustration]\r\n\r\n\r\n\r\n\r\nV--ADVICE FROM A CATERPILLAR\r\n\r\n\r\nAt last the Caterpillar took the hookah out of its mouth and addressed\r\nAlice in a languid, sleepy voice.\r\n\r\n\"Who are _you_?\" said the Caterpillar.\r\n\r"},{"id":97,"chunk":"\n[Illustration]\r\n\r\nAlice replied, rather shyly, \"I--I hardly know, sir, just at present--at\r\nleast I know who I _was_ when I got up this morning, but I think I must\r\nhave changed several times since then.\"\r\n\r\n\"What do you mean by that?\" said the Caterpillar, sternly. \"Explain\r\nyourself!\"\r\n\r\n\"I can't"},{"id":98,"chunk":" explain _myself_, I'm afraid, sir,\" said Alice, \"because I'm\r\nnot myself, you see--being so many different sizes in a day is very\r\nconfusing.\" She drew herself up and said very gravely, \"I think you\r\nought to tell me who _you_ are, first.\"\r\n\r\n\"Why?\" said the Caterpillar.\r\n\r\nAs Alice could not think"},{"id":99,"chunk":" of any good reason and the Caterpillar seemed\r\nto be in a _very_ unpleasant state of mind, she turned away.\r\n\r\n\"Come back!\" the Caterpillar called after her. \"I've something important\r\nto say!\" Alice turned and came back again.\r\n\r\n\"Keep your temper,\" said the Caterpillar.\r\n\r\n\"Is that all?\" said Ali"},{"id":100,"chunk":"ce, swallowing down her anger as well as she\r\ncould.\r\n\r\n\"No,\" said the Caterpillar.\r\n\r\nIt unfolded its arms, took the hookah out of its mouth again, and said,\r\n\"So you think you're changed, do you?\"\r\n\r\n\"I'm afraid, I am, sir,\" said Alice. \"I can't remember things as I\r\nused--and I don't keep the sam"},{"id":101,"chunk":"e size for ten minutes together!\"\r\n\r\n\"What size do you want to be?\" asked the Caterpillar.\r\n\r\n\"Oh, I'm not particular as to size,\" Alice hastily replied, \"only one\r\ndoesn't like changing so often, you know. I should like to be a _little_\r\nlarger, sir, if you wouldn't mind,\" said Alice. \"Three inches"},{"id":102,"chunk":" is such a\r\nwretched height to be.\"\r\n\r\n\"It is a very good height indeed!\" said the Caterpillar angrily, rearing\r\nitself upright as it spoke (it was exactly three inches high).\r\n\r\nIn a minute or two, the Caterpillar got down off the mushroom and\r\ncrawled away into the grass, merely remarking, as it w"},{"id":103,"chunk":"ent, \"One side\r\nwill make you grow taller, and the other side will make you grow\r\nshorter.\"\r\n\r\n\"One side of _what_? The other side of _what_?\" thought Alice to\r\nherself.\r\n\r\n\"Of the mushroom,\" said the Caterpillar, just as if she had asked it\r\naloud; and in another moment, it was out of sight.\r\n\r\nAli"},{"id":104,"chunk":"ce remained looking thoughtfully at the mushroom for a minute, trying\r\nto make out which were the two sides of it. At last she stretched her\r\narms 'round it as far as they would go, and broke off a bit of the edge\r\nwith each hand.\r\n\r\n\"And now which is which?\" she said to herself, and nibbled a littl"},{"id":105,"chunk":"e of\r\nthe right-hand bit to try the effect. The next moment she felt a violent\r\nblow underneath her chin--it had struck her foot!\r\n\r\nShe was a good deal frightened by this very sudden change, as she was\r\nshrinking rapidly; so she set to work at once to eat some of the other\r\nbit. Her chin was presse"},{"id":106,"chunk":"d so closely against her foot that there was\r\nhardly room to open her mouth; but she did it at last and managed to\r\nswallow a morsel of the left-hand bit....\r\n\r\n\"Come, my head's free at last!\" said Alice; but all she could see, when\r\nshe looked down, was an immense length of neck, which seemed to ri"},{"id":107,"chunk":"se\r\nlike a stalk out of a sea of green leaves that lay far below her.\r\n\r\n\"Where _have_ my shoulders got to? And oh, my poor hands, how is it I\r\ncan't see you?\" She was delighted to find that her neck would bend\r\nabout easily in any direction, like a serpent. She had just succeeded in\r\ncurving it dow"},{"id":108,"chunk":"n into a graceful zigzag and was going to dive in among\r\nthe leaves, when a sharp hiss made her draw back in a hurry--a large\r\npigeon had flown into her face and was beating her violently with its\r\nwings.\r\n\r\n[Illustration]\r\n\r\n\"Serpent!\" cried the Pigeon.\r\n\r\n\"I'm _not_ a serpent!\" said Alice indignan"},{"id":109,"chunk":"tly. \"Let me alone!\"\r\n\r\n\"I've tried the roots of trees, and I've tried banks, and I've tried\r\nhedges,\" the Pigeon went on, \"but those serpents! There's no pleasing\r\nthem!\"\r\n\r\nAlice was more and more puzzled.\r\n\r\n\"As if it wasn't trouble enough hatching the eggs,\" said the Pigeon,\r\n\"but I must be on t"},{"id":110,"chunk":"he look-out for serpents, night and day! And just as\r\nI'd taken the highest tree in the wood,\" continued the Pigeon, raising\r\nits voice to a shriek, \"and just as I was thinking I should be free of\r\nthem at last, they must needs come wriggling down from the sky! Ugh,\r\nSerpent!\"\r\n\r\n\"But I'm _not_ a se"},{"id":111,"chunk":"rpent, I tell you!\" said Alice. \"I'm a--I'm a--I'm a\r\nlittle girl,\" she added rather doubtfully, as she remembered the number\r\nof changes she had gone through that day.\r\n\r\n\"You're looking for eggs, I know _that_ well enough,\" said the Pigeon;\r\n\"and what does it matter to me whether you're a little g"},{"id":112,"chunk":"irl or a\r\nserpent?\"\r\n\r\n\"It matters a good deal to _me_,\" said Alice hastily; \"but I'm not\r\nlooking for eggs, as it happens, and if I was, I shouldn't want\r\n_yours_--I don't like them raw.\"\r\n\r\n\"Well, be off, then!\" said the Pigeon in a sulky tone, as it settled\r\ndown again into its nest. Alice crouch"},{"id":113,"chunk":"ed down among the trees as well as\r\nshe could, for her neck kept getting entangled among the branches, and\r\nevery now and then she had to stop and untwist it. After awhile she\r\nremembered that she still held the pieces of mushroom in her hands, and\r\nshe set to work very carefully, nibbling first at "},{"id":114,"chunk":"one and then at the\r\nother, and growing sometimes taller and sometimes shorter, until she had\r\nsucceeded in bringing herself down to her usual height.\r\n\r\nIt was so long since she had been anything near the right size that it\r\nfelt quite strange at first. \"The next thing is to get into that\r\nbeautifu"},{"id":115,"chunk":"l garden--how _is_ that to be done, I wonder?\" As she said this,\r\nshe came suddenly upon an open place, with a little house in it about\r\nfour feet high. \"Whoever lives there,\" thought Alice, \"it'll never do to\r\ncome upon them _this_ size; why, I should frighten them out of their\r\nwits!\" She did not "},{"id":116,"chunk":"venture to go near the house till she had brought\r\nherself down to nine inches high.\r\n\r\n\r\n\r\n\r\nVI--PIG AND PEPPER\r\n\r\n\r\nFor a minute or two she stood looking at the house, when suddenly a\r\nfootman in livery came running out of the wood (judging by his face\r\nonly, she would have called him a fish)--and"},{"id":117,"chunk":" rapped loudly at the door\r\nwith his knuckles. It was opened by another footman in livery, with a\r\nround face and large eyes like a frog.\r\n\r\n[Illustration]\r\n\r\nThe Fish-Footman began by producing from under his arm a great letter,\r\nand this he handed over to the other, saying, in a solemn tone, \"For "},{"id":118,"chunk":"the\r\nDuchess. An invitation from the Queen to play croquet.\" The\r\nFrog-Footman repeated, in the same solemn tone, \"From the Queen. An\r\ninvitation for the Duchess to play croquet.\" Then they both bowed low\r\nand their curls got entangled together.\r\n\r\nWhen Alice next peeped out, the Fish-Footman was go"},{"id":119,"chunk":"ne, and the other was\r\nsitting on the ground near the door, staring stupidly up into the sky.\r\nAlice went timidly up to the door and knocked.\r\n\r\n\"There's no sort of use in knocking,\" said the Footman, \"and that for\r\ntwo reasons. First, because I'm on the same side of the door as you are;\r\nsecondly, "},{"id":120,"chunk":"because they're making such a noise inside, no one could\r\npossibly hear you.\" And certainly there _was_ a most extraordinary noise\r\ngoing on within--a constant howling and sneezing, and every now and then\r\na great crash, as if a dish or kettle had been broken to pieces.\r\n\r\n\"How am I to get in?\" aske"},{"id":121,"chunk":"d Alice.\r\n\r\n\"_Are_ you to get in at all?\" said the Footman. \"That's the first\r\nquestion, you know.\"\r\n\r\nAlice opened the door and went in. The door led right into a large\r\nkitchen, which was full of smoke from one end to the other; the Duchess\r\nwas sitting on a three-legged stool in the middle, nursi"},{"id":122,"chunk":"ng a baby; the\r\ncook was leaning over the fire, stirring a large caldron which seemed to\r\nbe full of soup.\r\n\r\n\"There's certainly too much pepper in that soup!\" Alice said to herself,\r\nas well as she could for sneezing. Even the Duchess sneezed\r\noccasionally; and as for the baby, it was sneezing and "},{"id":123,"chunk":"howling\r\nalternately without a moment's pause. The only two creatures in the\r\nkitchen that did _not_ sneeze were the cook and a large cat, which was\r\ngrinning from ear to ear.\r\n\r\n\"Please would you tell me,\" said Alice, a little timidly, \"why your cat\r\ngrins like that?\"\r\n\r\n\"It's a Cheshire-Cat,\" said"},{"id":124,"chunk":" the Duchess, \"and that's why.\"\r\n\r\n\"I didn't know that Cheshire-Cats always grinned; in fact, I didn't know\r\nthat cats _could_ grin,\" said Alice.\r\n\r\n\"You don't know much,\" said the Duchess, \"and that's a fact.\"\r\n\r\nJust then the cook took the caldron of soup off the fire, and at once\r\nset to work thr"},{"id":125,"chunk":"owing everything within her reach at the Duchess and the\r\nbaby--the fire-irons came first; then followed a shower of saucepans,\r\nplates and dishes. The Duchess took no notice of them, even when they\r\nhit her, and the baby was howling so much already that it was quite\r\nimpossible to say whether the b"},{"id":126,"chunk":"lows hurt it or not.\r\n\r\n\"Oh, _please_ mind what you're doing!\" cried Alice, jumping up and down\r\nin an agony of terror.\r\n\r\n\"Here! You may nurse it a bit, if you like!\" the Duchess said to Alice,\r\nflinging the baby at her as she spoke. \"I must go and get ready to play\r\ncroquet with the Queen,\" and sh"},{"id":127,"chunk":"e hurried out of the room.\r\n\r\nAlice caught the baby with some difficulty, as it was a queer-shaped\r\nlittle creature and held out its arms and legs in all directions. \"If I\r\ndon't take this child away with me,\" thought Alice, \"they're sure to\r\nkill it in a day or two. Wouldn't it be murder to leave i"},{"id":128,"chunk":"t behind?\" She\r\nsaid the last words out loud and the little thing grunted in reply.\r\n\r\n\"If you're going to turn into a pig, my dear,\" said Alice, \"I'll have\r\nnothing more to do with you. Mind now!\"\r\n\r\nAlice was just beginning to think to herself, \"Now, what am I to do with\r\nthis creature, when I get"},{"id":129,"chunk":" it home?\" when it grunted again so violently\r\nthat Alice looked down into its face in some alarm. This time there\r\ncould be _no_ mistake about it--it was neither more nor less than a pig;\r\nso she set the little creature down and felt quite relieved to see it\r\ntrot away quietly into the wood.\r\n\r\nAli"},{"id":130,"chunk":"ce was a little startled by seeing the Cheshire-Cat sitting on a\r\nbough of a tree a few yards off. The Cat only grinned when it saw her.\r\n\"Cheshire-Puss,\" began Alice, rather timidly, \"would you please tell me\r\nwhich way I ought to go from here?\"\r\n\r\n\"In _that_ direction,\" the Cat said, waving the ri"},{"id":131,"chunk":"ght paw 'round, \"lives\r\na Hatter; and in _that_ direction,\" waving the other paw, \"lives a March\r\nHare. Visit either you like; they're both mad.\"\r\n\r\n\"But I don't want to go among mad people,\" Alice remarked.\r\n\r\n\"Oh, you can't help that,\" said the Cat; \"we're all mad here. Do you\r\nplay croquet with t"},{"id":132,"chunk":"he Queen to-day?\"\r\n\r\n\"I should like it very much,\" said Alice, \"but I haven't been invited\r\nyet.\"\r\n\r\n\"You'll see me there,\" said the Cat, and vanished.\r\n\r\nAlice had not gone much farther before she came in sight of the house of\r\nthe March Hare; it was so large a house that she did not like to go nea"},{"id":133,"chunk":"r\r\ntill she had nibbled some more of the left-hand bit of mushroom.\r\n\r\n\r\n\r\n\r\nVII--A MAD TEA-PARTY\r\n\r\n\r\nThere was a table set out under a tree in front of the house, and the\r\nMarch Hare and the Hatter were having tea at it; a Dormouse was sitting\r\nbetween them, fast asleep.\r\n\r\nThe table was a large o"},{"id":134,"chunk":"ne, but the three were all crowded together at\r\none corner of it. \"No room! No room!\" they cried out when they saw Alice\r\ncoming. \"There's _plenty_ of room!\" said Alice indignantly, and she sat\r\ndown in a large arm-chair at one end of the table.\r\n\r\nThe Hatter opened his eyes very wide on hearing thi"},{"id":135,"chunk":"s, but all he said\r\nwas \"Why is a raven like a writing-desk?\"\r\n\r\n\"I'm glad they've begun asking riddles--I believe I can guess that,\" she\r\nadded aloud.\r\n\r\n\"Do you mean that you think you can find out the answer to it?\" said the\r\nMarch Hare.\r\n\r\n\"Exactly so,\" said Alice.\r\n\r\n\"Then you should say what y"},{"id":136,"chunk":"ou mean,\" the March Hare went on.\r\n\r\n\"I do,\" Alice hastily replied; \"at least--at least I mean what I\r\nsay--that's the same thing, you know.\"\r\n\r\n\"You might just as well say,\" added the Dormouse, which seemed to be\r\ntalking in its sleep, \"that 'I breathe when I sleep' is the same thing\r\nas 'I sleep w"},{"id":137,"chunk":"hen I breathe!'\"\r\n\r\n\"It _is_ the same thing with you,\" said the Hatter, and he poured a\r\nlittle hot tea upon its nose. The Dormouse shook its head impatiently\r\nand said, without opening its eyes, \"Of course, of course; just what I\r\nwas going to remark myself.\"\r\n\r\n[Illustration]\r\n\r\n\"Have you guessed "},{"id":138,"chunk":"the riddle yet?\" the Hatter said, turning to Alice\r\nagain.\r\n\r\n\"No, I give it up,\" Alice replied. \"What's the answer?\"\r\n\r\n\"I haven't the slightest idea,\" said the Hatter.\r\n\r\n\"Nor I,\" said the March Hare.\r\n\r\nAlice gave a weary sigh. \"I think you might do something better with the\r\ntime,\" she said, \"th"},{"id":139,"chunk":"an wasting it in asking riddles that have no\r\nanswers.\"\r\n\r\n\"Take some more tea,\" the March Hare said to Alice, very earnestly.\r\n\r\n\"I've had nothing yet,\" Alice replied in an offended tone, \"so I can't\r\ntake more.\"\r\n\r\n\"You mean you can't take _less_,\" said the Hatter; \"it's very easy to\r\ntake _more_ "},{"id":140,"chunk":"than nothing.\"\r\n\r\nAt this, Alice got up and walked off. The Dormouse fell asleep instantly\r\nand neither of the others took the least notice of her going, though she\r\nlooked back once or twice; the last time she saw them, they were\r\ntrying to put the Dormouse into the tea-pot.\r\n\r\n[Illustration: The T"},{"id":141,"chunk":"rial of the Knave of Hearts.]\r\n\r\n\"At any rate, I'll never go _there_ again!\" said Alice, as she picked\r\nher way through the wood. \"It's the stupidest tea-party I ever was at in\r\nall my life!\" Just as she said this, she noticed that one of the trees\r\nhad a door leading right into it. \"That's very cur"},{"id":142,"chunk":"ious!\" she thought. \"I\r\nthink I may as well go in at once.\" And in she went.\r\n\r\nOnce more she found herself in the long hall and close to the little\r\nglass table. Taking the little golden key, she unlocked the door that\r\nled into the garden. Then she set to work nibbling at the mushroom (she\r\nhad ke"},{"id":143,"chunk":"pt a piece of it in her pocket) till she was about a foot high;\r\nthen she walked down the little passage; and _then_--she found herself\r\nat last in the beautiful garden, among the bright flower-beds and the\r\ncool fountains.\r\n\r\n\r\n\r\n\r\nVIII--THE QUEEN'S CROQUET GROUND\r\n\r\n\r\nA large rose-tree stood near "},{"id":144,"chunk":"the entrance of the garden; the roses\r\ngrowing on it were white, but there were three gardeners at it, busily\r\npainting them red. Suddenly their eyes chanced to fall upon Alice, as\r\nshe stood watching them. \"Would you tell me, please,\" said Alice, a\r\nlittle timidly, \"why you are painting those roses"},{"id":145,"chunk":"?\"\r\n\r\nFive and Seven said nothing, but looked at Two. Two began, in a low\r\nvoice, \"Why, the fact is, you see, Miss, this here ought to have been a\r\n_red_ rose-tree, and we put a white one in by mistake; and, if the Queen\r\nwas to find it out, we should all have our heads cut off, you know. So\r\nyou se"},{"id":146,"chunk":"e, Miss, we're doing our best, afore she comes, to--\" At this\r\nmoment, Five, who had been anxiously looking across the garden, called\r\nout, \"The Queen! The Queen!\" and the three gardeners instantly threw\r\nthemselves flat upon their faces. There was a sound of many footsteps\r\nand Alice looked 'round,"},{"id":147,"chunk":" eager to see the Queen.\r\n\r\nFirst came ten soldiers carrying clubs, with their hands and feet at the\r\ncorners: next the ten courtiers; these were ornamented all over with\r\ndiamonds. After these came the royal children; there were ten of them,\r\nall ornamented with hearts. Next came the guests, mostly"},{"id":148,"chunk":" Kings and\r\nQueens, and among them Alice recognized the White Rabbit. Then followed\r\nthe Knave of Hearts, carrying the King's crown on a crimson velvet\r\ncushion; and last of all this grand procession came THE KING AND THE\r\nQUEEN OF HEARTS.\r\n\r\nWhen the procession came opposite to Alice, they all stop"},{"id":149,"chunk":"ped and looked\r\nat her, and the Queen said severely, \"Who is this?\" She said it to the\r\nKnave of Hearts, who only bowed and smiled in reply.\r\n\r\n\"My name is Alice, so please Your Majesty,\" said Alice very politely;\r\nbut she added to herself, \"Why, they're only a pack of cards, after\r\nall!\"\r\n\r\n\"Can yo"},{"id":150,"chunk":"u play croquet?\" shouted the Queen. The question was evidently\r\nmeant for Alice.\r\n\r\n\"Yes!\" said Alice loudly.\r\n\r\n\"Come on, then!\" roared the Queen.\r\n\r\n\"It's--it's a very fine day!\" said a timid voice to Alice. She was\r\nwalking by the White Rabbit, who was peeping anxiously into her face.\r\n\r\n\"Very,\" "},{"id":151,"chunk":"said Alice. \"Where's the Duchess?\"\r\n\r\n\"Hush! Hush!\" said the Rabbit. \"She's under sentence of execution.\"\r\n\r\n\"What for?\" said Alice.\r\n\r\n\"She boxed the Queen's ears--\" the Rabbit began.\r\n\r\n\"Get to your places!\" shouted the Queen in a voice of thunder, and\r\npeople began running about in all directions"},{"id":152,"chunk":", tumbling up against each\r\nother. However, they got settled down in a minute or two, and the game\r\nbegan.\r\n\r\nAlice thought she had never seen such a curious croquet-ground in her\r\nlife; it was all ridges and furrows. The croquet balls were live\r\nhedgehogs, and the mallets live flamingos and the sol"},{"id":153,"chunk":"diers had to double\r\nthemselves up and stand on their hands and feet, to make the arches.\r\n\r\nThe players all played at once, without waiting for turns, quarrelling\r\nall the while and fighting for the hedgehogs; and in a very short time,\r\nthe Queen was in a furious passion and went stamping about and"},{"id":154,"chunk":" shouting,\r\n\"Off with his head!\" or \"Off with her head!\" about once in a minute.\r\n\r\n\"They're dreadfully fond of beheading people here,\" thought Alice; \"the\r\ngreat wonder is that there's anyone left alive!\"\r\n\r\nShe was looking about for some way of escape, when she noticed a curious\r\nappearance in the"},{"id":155,"chunk":" air. \"It's the Cheshire-Cat,\" she said to herself;\r\n\"now I shall have somebody to talk to.\"\r\n\r\n\"How are you getting on?\" said the Cat.\r\n\r\n\"I don't think they play at all fairly,\" Alice said, in a rather\r\ncomplaining tone; \"and they all quarrel so dreadfully one can't hear\r\noneself speak--and they d"},{"id":156,"chunk":"on't seem to have any rules in particular.\"\r\n\r\n\"How do you like the Queen?\" said the Cat in a low voice.\r\n\r\n\"Not at all,\" said Alice.\r\n\r\n[Illustration]\r\n\r\nAlice thought she might as well go back and see how the game was going\r\non. So she went off in search of her hedgehog. The hedgehog was engaged\r\n"},{"id":157,"chunk":"in a fight with another hedgehog, which seemed to Alice an excellent\r\nopportunity for croqueting one of them with the other; the only\r\ndifficulty was that her flamingo was gone across to the other side of\r\nthe garden, where Alice could see it trying, in a helpless sort of way,\r\nto fly up into a tree"},{"id":158,"chunk":". She caught the flamingo and tucked it away under\r\nher arm, that it might not escape again.\r\n\r\nJust then Alice ran across the Duchess (who was now out of prison). She\r\ntucked her arm affectionately into Alice's and they walked off together.\r\nAlice was very glad to find her in such a pleasant temper"},{"id":159,"chunk":". She was a\r\nlittle startled, however, when she heard the voice of the Duchess close\r\nto her ear. \"You're thinking about something, my dear, and that makes\r\nyou forget to talk.\"\r\n\r\n\"The game's going on rather better now,\" Alice said, by way of keeping\r\nup the conversation a little.\r\n\r\n\"'Tis so,\" sai"},{"id":160,"chunk":"d the Duchess; \"and the moral of that is--'Oh, 'tis love,\r\n'tis love that makes the world go 'round!'\"\r\n\r\n\"Somebody said,\" Alice whispered, \"that it's done by everybody minding\r\nhis own business!\"\r\n\r\n\"Ah, well! It means much the same thing,\" said the Duchess, digging her\r\nsharp little chin into Alic"},{"id":161,"chunk":"e's shoulder, as she added \"and the moral of\r\n_that_ is--'Take care of the sense and the sounds will take care of\r\nthemselves.'\"\r\n\r\nTo Alice's great surprise, the Duchess's arm that was linked into hers\r\nbegan to tremble. Alice looked up and there stood the Queen in front of\r\nthem, with her arms fol"},{"id":162,"chunk":"ded, frowning like a thunderstorm!\r\n\r\n\"Now, I give you fair warning,\" shouted the Queen, stamping on the\r\nground as she spoke, \"either you or your head must be off, and that in\r\nabout half no time. Take your choice!\" The Duchess took her choice, and\r\nwas gone in a moment.\r\n\r\n\"Let's go on with the ga"},{"id":163,"chunk":"me,\" the Queen said to Alice; and Alice was too\r\nmuch frightened to say a word, but slowly followed her back to the\r\ncroquet-ground.\r\n\r\nAll the time they were playing, the Queen never left off quarreling with\r\nthe other players and shouting, \"Off with his head!\" or \"Off with her\r\nhead!\" By the end o"},{"id":164,"chunk":"f half an hour or so, all the players, except the\r\nKing, the Queen and Alice, were in custody of the soldiers and under\r\nsentence of execution.\r\n\r\nThen the Queen left off, quite out of breath, and walked away with\r\nAlice.\r\n\r\nAlice heard the King say in a low voice to the company generally, \"You\r\nare"},{"id":165,"chunk":" all pardoned.\"\r\n\r\nSuddenly the cry \"The Trial's beginning!\" was heard in the distance, and\r\nAlice ran along with the others.\r\n\r\n\r\n\r\n\r\nIX--WHO STOLE THE TARTS?\r\n\r\n\r\nThe King and Queen of Hearts were seated on their throne when they\r\narrived, with a great crowd assembled about them--all sorts of litt"},{"id":166,"chunk":"le\r\nbirds and beasts, as well as the whole pack of cards: the Knave was\r\nstanding before them, in chains, with a soldier on each side to guard\r\nhim; and near the King was the White Rabbit, with a trumpet in one hand\r\nand a scroll of parchment in the other. In the very middle of the court\r\nwas a tabl"},{"id":167,"chunk":"e, with a large dish of tarts upon it. \"I wish they'd get the\r\ntrial done,\" Alice thought, \"and hand 'round the refreshments!\"\r\n\r\nThe judge, by the way, was the King and he wore his crown over his great\r\nwig. \"That's the jury-box,\" thought Alice; \"and those twelve creatures\r\n(some were animals and s"},{"id":168,"chunk":"ome were birds) I suppose they are the jurors.\"\r\n\r\nJust then the White Rabbit cried out \"Silence in the court!\"\r\n\r\n\"Herald, read the accusation!\" said the King.\r\n\r\n[Illustration]\r\n\r\nOn this, the White Rabbit blew three blasts on the trumpet, then\r\nunrolled the parchment-scroll and read as follows:\r\n"},{"id":169,"chunk":"\r\n    \"The Queen of Hearts, she made some tarts,\r\n      All on a summer day;\r\n    The Knave of Hearts, he stole those tarts\r\n      And took them quite away!\"\r\n\r\n\"Call the first witness,\" said the King; and the White Rabbit blew three\r\nblasts on the trumpet and called out, \"First witness!\"\r\n\r\nThe fir"},{"id":170,"chunk":"st witness was the Hatter. He came in with a teacup in one hand\r\nand a piece of bread and butter in the other.\r\n\r\n\"You ought to have finished,\" said the King. \"When did you begin?\"\r\n\r\nThe Hatter looked at the March Hare, who had followed him into the\r\ncourt, arm in arm with the Dormouse. \"Fourteenth"},{"id":171,"chunk":" of March, I _think_ it\r\nwas,\" he said.\r\n\r\n\"Give your evidence,\" said the King, \"and don't be nervous, or I'll have\r\nyou executed on the spot.\"\r\n\r\nThis did not seem to encourage the witness at all; he kept shifting from\r\none foot to the other, looking uneasily at the Queen, and, in his\r\nconfusion, h"},{"id":172,"chunk":"e bit a large piece out of his teacup instead of the bread\r\nand butter.\r\n\r\nJust at this moment Alice felt a very curious sensation--she was\r\nbeginning to grow larger again.\r\n\r\nThe miserable Hatter dropped his teacup and bread and butter and went\r\ndown on one knee. \"I'm a poor man, Your Majesty,\" he "},{"id":173,"chunk":"began.\r\n\r\n\"You're a _very_ poor _speaker_,\" said the King.\r\n\r\n\"You may go,\" said the King, and the Hatter hurriedly left the court.\r\n\r\n\"Call the next witness!\" said the King.\r\n\r\nThe next witness was the Duchess's cook. She carried the pepper-box in\r\nher hand and the people near the door began sneezi"},{"id":174,"chunk":"ng all at once.\r\n\r\n\"Give your evidence,\" said the King.\r\n\r\n\"Sha'n't,\" said the cook.\r\n\r\nThe King looked anxiously at the White Rabbit, who said, in a low voice,\r\n\"Your Majesty must cross-examine _this_ witness.\"\r\n\r\n\"Well, if I must, I must,\" the King said. \"What are tarts made of?\"\r\n\r\n\"Pepper, mostl"},{"id":175,"chunk":"y,\" said the cook.\r\n\r\nFor some minutes the whole court was in confusion and by the time they\r\nhad settled down again, the cook had disappeared.\r\n\r\n\"Never mind!\" said the King, \"call the next witness.\"\r\n\r\nAlice watched the White Rabbit as he fumbled over the list. Imagine her\r\nsurprise when he read o"},{"id":176,"chunk":"ut, at the top of his shrill little voice, the\r\nname \"Alice!\"\r\n\r\n\r\n\r\n\r\nX--ALICE'S EVIDENCE\r\n\r\n\r\n\"Here!\" cried Alice. She jumped up in such a hurry that she tipped over\r\nthe jury-box, upsetting all the jurymen on to the heads of the crowd\r\nbelow.\r\n\r\n\"Oh, I _beg_ your pardon!\" she exclaimed in a tone "},{"id":177,"chunk":"of great dismay.\r\n\r\n\"The trial cannot proceed,\" said the King, \"until all the jurymen are\r\nback in their proper places--_all_,\" he repeated with great emphasis,\r\nlooking hard at Alice.\r\n\r\n\"What do you know about this business?\" the King said to Alice.\r\n\r\n\"Nothing whatever,\" said Alice.\r\n\r\nThe King t"},{"id":178,"chunk":"hen read from his book: \"Rule forty-two. _All persons more\r\nthan a mile high to leave the court_.\"\r\n\r\n\"_I'm_ not a mile high,\" said Alice.\r\n\r\n\"Nearly two miles high,\" said the Queen.\r\n\r\n[Illustration]\r\n\r\n\"Well, I sha'n't go, at any rate,\" said Alice.\r\n\r\nThe King turned pale and shut his note-book ha"},{"id":179,"chunk":"stily. \"Consider your\r\nverdict,\" he said to the jury, in a low, trembling voice.\r\n\r\n\"There's more evidence to come yet, please Your Majesty,\" said the White\r\nRabbit, jumping up in a great hurry. \"This paper has just been picked\r\nup. It seems to be a letter written by the prisoner to--to somebody.\" H"},{"id":180,"chunk":"e\r\nunfolded the paper as he spoke and added, \"It isn't a letter, after all;\r\nit's a set of verses.\"\r\n\r\n\"Please, Your Majesty,\" said the Knave, \"I didn't write it and they\r\ncan't prove that I did; there's no name signed at the end.\"\r\n\r\n\"You _must_ have meant some mischief, or else you'd have signed y"},{"id":181,"chunk":"our\r\nname like an honest man,\" said the King. There was a general clapping of\r\nhands at this.\r\n\r\n\"Read them,\" he added, turning to the White Rabbit.\r\n\r\nThere was dead silence in the court whilst the White Rabbit read out the\r\nverses.\r\n\r\n\"That's the most important piece of evidence we've heard yet,\" "},{"id":182,"chunk":"said the\r\nKing.\r\n\r\n\"_I_ don't believe there's an atom of meaning in it,\" ventured Alice.\r\n\r\n\"If there's no meaning in it,\" said the King, \"that saves a world of\r\ntrouble, you know, as we needn't try to find any. Let the jury consider\r\ntheir verdict.\"\r\n\r\n\"No, no!\" said the Queen. \"Sentence first--ver"},{"id":183,"chunk":"dict afterwards.\"\r\n\r\n\"Stuff and nonsense!\" said Alice loudly. \"The idea of having the\r\nsentence first!\"\r\n\r\n\"Hold your tongue!\" said the Queen, turning purple.\r\n\r\n\"I won't!\" said Alice.\r\n\r\n\"Off with her head!\" the Queen shouted at the top of her voice. Nobody\r\nmoved.\r\n\r\n\"Who cares for _you_?\" said Al"},{"id":184,"chunk":"ice (she had grown to her full size by\r\nthis time). \"You're nothing but a pack of cards!\"\r\n\r\n[Illustration]\r\n\r\nAt this, the whole pack rose up in the air and came flying down upon\r\nher; she gave a little scream, half of fright and half of anger, and\r\ntried to beat them off, and found herself lying o"},{"id":185,"chunk":"n the bank, with her\r\nhead in the lap of her sister, who was gently brushing away some dead\r\nleaves that had fluttered down from the trees upon her face.\r\n\r\n\"Wake up, Alice dear!\" said her sister. \"Why, what a long sleep you've\r\nhad!\"\r\n\r\n\"Oh, I've had such a curious dream!\" said Alice. And she told "},{"id":186,"chunk":"her\r\nsister, as well as she could remember them, all these strange adventures\r\nof hers that you have just been reading about. Alice got up and ran off,\r\nthinking while she ran, as well she might, what a wonderful dream it had\r\nbeen.\r\n\r\n[Illustration]\r\n\r\n\r\n\r\n*** END OF THE PROJECT GUTENBERG EBOOK ALI"},{"id":187,"chunk":"CE'S ADVENTURES IN WONDERLAND ***\r\n\r\n\r\n    \r\n\r\nUpdated editions will replace the previous one—the old editions will\r\nbe renamed.\r\n\r\nCreating the works from print editions not protected by U.S. copyright\r\nlaw means that no one owns a United States copyright in these works,\r\nso the Foundation (and you"},{"id":188,"chunk":"!) can copy and distribute it in the United\r\nStates without permission and without paying copyright\r\nroyalties. Special rules, set forth in the General Terms of Use part\r\nof this license, apply to copying and distributing Project\r\nGutenberg™ electronic works to protect the PROJECT GUTENBERG™\r\nconcep"},{"id":189,"chunk":"t and trademark. Project Gutenberg is a registered trademark,\r\nand may not be used if you charge for an eBook, except by following\r\nthe terms of the trademark license, including paying royalties for use\r\nof the Project Gutenberg trademark. If you do not charge anything for\r\ncopies of this eBook, com"},{"id":190,"chunk":"plying with the trademark license is very\r\neasy. You may use this eBook for nearly any purpose such as creation\r\nof derivative works, reports, performances and research. Project\r\nGutenberg eBooks may be modified and printed and given away—you may\r\ndo practically ANYTHING in the United States with eB"},{"id":191,"chunk":"ooks not protected\r\nby U.S. copyright law. Redistribution is subject to the trademark\r\nlicense, especially commercial redistribution.\r\n\r\n\r\nSTART: FULL LICENSE\r\n\r\nTHE FULL PROJECT GUTENBERG LICENSE\r\n\r\nPLEASE READ THIS BEFORE YOU DISTRIBUTE OR USE THIS WORK\r\n\r\nTo protect the Project Gutenberg™ mission"},{"id":192,"chunk":" of promoting the free\r\ndistribution of electronic works, by using or distributing this work\r\n(or any other work associated in any way with the phrase “Project\r\nGutenberg”), you agree to comply with all the terms of the Full\r\nProject Gutenberg™ License available with this file or online at\r\nwww.gute"},{"id":193,"chunk":"nberg.org/license.\r\n\r\nSection 1. General Terms of Use and Redistributing Project Gutenberg™\r\nelectronic works\r\n\r\n1.A. By reading or using any part of this Project Gutenberg™\r\nelectronic work, you indicate that you have read, understand, agree to\r\nand accept all the terms of this license and intellec"},{"id":194,"chunk":"tual property\r\n(trademark/copyright) agreement. If you do not agree to abide by all\r\nthe terms of this agreement, you must cease using and return or\r\ndestroy all copies of Project Gutenberg™ electronic works in your\r\npossession. If you paid a fee for obtaining a copy of or access to a\r\nProject Guten"},{"id":195,"chunk":"berg™ electronic work and you do not agree to be bound\r\nby the terms of this agreement, you may obtain a refund from the person\r\nor entity to whom you paid the fee as set forth in paragraph 1.E.8.\r\n\r\n1.B. “Project Gutenberg” is a registered trademark. It may only be\r\nused on or associated in any way"},{"id":196,"chunk":" with an electronic work by people who\r\nagree to be bound by the terms of this agreement. There are a few\r\nthings that you can do with most Project Gutenberg™ electronic works\r\neven without complying with the full terms of this agreement. See\r\nparagraph 1.C below. There are a lot of things you can d"},{"id":197,"chunk":"o with Project\r\nGutenberg™ electronic works if you follow the terms of this\r\nagreement and help preserve free future access to Project Gutenberg™\r\nelectronic works. See paragraph 1.E below.\r\n\r\n1.C. The Project Gutenberg Literary Archive Foundation (“the\r\nFoundation” or PGLAF), owns a compilation cop"},{"id":198,"chunk":"yright in the collection\r\nof Project Gutenberg™ electronic works. Nearly all the individual\r\nworks in the collection are in the public domain in the United\r\nStates. If an individual work is unprotected by copyright law in the\r\nUnited States and you are located in the United States, we do not\r\nclaim "},{"id":199,"chunk":"a right to prevent you from copying, distributing, performing,\r\ndisplaying or creating derivative works based on the work as long as\r\nall references to Project Gutenberg are removed. Of course, we hope\r\nthat you will support the Project Gutenberg™ mission of promoting\r\nfree access to electronic work"},{"id":200,"chunk":"s by freely sharing Project Gutenberg™\r\nworks in compliance with the terms of this agreement for keeping the\r\nProject Gutenberg™ name associated with the work. You can easily\r\ncomply with the terms of this agreement by keeping this work in the\r\nsame format with its attached full Project Gutenberg™ L"},{"id":201,"chunk":"icense when\r\nyou share it without charge with others.\r\n\r\n1.D. The copyright laws of the place where you are located also govern\r\nwhat you can do with this work. Copyright laws in most countries are\r\nin a constant state of change. If you are outside the United States,\r\ncheck the laws of your country "},{"id":202,"chunk":"in addition to the terms of this\r\nagreement before downloading, copying, displaying, performing,\r\ndistributing or creating derivative works based on this work or any\r\nother Project Gutenberg™ work. The Foundation makes no\r\nrepresentations concerning the copyright status of any work in any\r\ncountry o"},{"id":203,"chunk":"ther than the United States.\r\n\r\n1.E. Unless you have removed all references to Project Gutenberg:\r\n\r\n1.E.1. The following sentence, with active links to, or other\r\nimmediate access to, the full Project Gutenberg™ License must appear\r\nprominently whenever any copy of a Project Gutenberg™ work (any wo"},{"id":204,"chunk":"rk\r\non which the phrase “Project Gutenberg” appears, or with which the\r\nphrase “Project Gutenberg” is associated) is accessed, displayed,\r\nperformed, viewed, copied or distributed:\r\n\r\n    This eBook is for the use of anyone anywhere in the United States and most\r\n    other parts of the world at no c"},{"id":205,"chunk":"ost and with almost no restrictions\r\n    whatsoever. You may copy it, give it away or re-use it under the terms\r\n    of the Project Gutenberg License included with this eBook or online\r\n    at www.gutenberg.org. If you\r\n    are not located in the United States, you will have to check the laws\r\n    o"},{"id":206,"chunk":"f the country where you are located before using this eBook.\r\n  \r\n1.E.2. If an individual Project Gutenberg™ electronic work is\r\nderived from texts not protected by U.S. copyright law (does not\r\ncontain a notice indicating that it is posted with permission of the\r\ncopyright holder), the work can be "},{"id":207,"chunk":"copied and distributed to anyone in\r\nthe United States without paying any fees or charges. If you are\r\nredistributing or providing access to a work with the phrase “Project\r\nGutenberg” associated with or appearing on the work, you must comply\r\neither with the requirements of paragraphs 1.E.1 through"},{"id":208,"chunk":" 1.E.7 or\r\nobtain permission for the use of the work and the Project Gutenberg™\r\ntrademark as set forth in paragraphs 1.E.8 or 1.E.9.\r\n\r\n1.E.3. If an individual Project Gutenberg™ electronic work is posted\r\nwith the permission of the copyright holder, your use and distribution\r\nmust comply with both"},{"id":209,"chunk":" paragraphs 1.E.1 through 1.E.7 and any\r\nadditional terms imposed by the copyright holder. Additional terms\r\nwill be linked to the Project Gutenberg™ License for all works\r\nposted with the permission of the copyright holder found at the\r\nbeginning of this work.\r\n\r\n1.E.4. Do not unlink or detach or r"},{"id":210,"chunk":"emove the full Project Gutenberg™\r\nLicense terms from this work, or any files containing a part of this\r\nwork or any other work associated with Project Gutenberg™.\r\n\r\n1.E.5. Do not copy, display, perform, distribute or redistribute this\r\nelectronic work, or any part of this electronic work, without\r"},{"id":211,"chunk":"\nprominently displaying the sentence set forth in paragraph 1.E.1 with\r\nactive links or immediate access to the full terms of the Project\r\nGutenberg™ License.\r\n\r\n1.E.6. You may convert to and distribute this work in any binary,\r\ncompressed, marked up, nonproprietary or proprietary form, including\r\na"},{"id":212,"chunk":"ny word processing or hypertext form. However, if you provide access\r\nto or distribute copies of a Project Gutenberg™ work in a format\r\nother than “Plain Vanilla ASCII” or other format used in the official\r\nversion posted on the official Project Gutenberg™ website\r\n(www.gutenberg.org), you must, at "},{"id":213,"chunk":"no additional cost, fee or expense\r\nto the user, provide a copy, a means of exporting a copy, or a means\r\nof obtaining a copy upon request, of the work in its original “Plain\r\nVanilla ASCII” or other form. Any alternate format must include the\r\nfull Project Gutenberg™ License as specified in paragra"},{"id":214,"chunk":"ph 1.E.1.\r\n\r\n1.E.7. Do not charge a fee for access to, viewing, displaying,\r\nperforming, copying or distributing any Project Gutenberg™ works\r\nunless you comply with paragraph 1.E.8 or 1.E.9.\r\n\r\n1.E.8. You may charge a reasonable fee for copies of or providing\r\naccess to or distributing Project Gute"},{"id":215,"chunk":"nberg™ electronic works\r\nprovided that:\r\n\r\n    • You pay a royalty fee of 20% of the gross profits you derive from\r\n        the use of Project Gutenberg™ works calculated using the method\r\n        you already use to calculate your applicable taxes. The fee is owed\r\n        to the owner of the Projec"},{"id":216,"chunk":"t Gutenberg™ trademark, but he has\r\n        agreed to donate royalties under this paragraph to the Project\r\n        Gutenberg Literary Archive Foundation. Royalty payments must be paid\r\n        within 60 days following each date on which you prepare (or are\r\n        legally required to prepare) your"},{"id":217,"chunk":" periodic tax returns. Royalty\r\n        payments should be clearly marked as such and sent to the Project\r\n        Gutenberg Literary Archive Foundation at the address specified in\r\n        Section 4, “Information about donations to the Project Gutenberg\r\n        Literary Archive Foundation.”\r\n    \r"},{"id":218,"chunk":"\n    • You provide a full refund of any money paid by a user who notifies\r\n        you in writing (or by e-mail) within 30 days of receipt that s/he\r\n        does not agree to the terms of the full Project Gutenberg™\r\n        License. You must require such a user to return or destroy all\r\n        co"},{"id":219,"chunk":"pies of the works possessed in a physical medium and discontinue\r\n        all use of and all access to other copies of Project Gutenberg™\r\n        works.\r\n    \r\n    • You provide, in accordance with paragraph 1.F.3, a full refund of\r\n        any money paid for a work or a replacement copy, if a defe"},{"id":220,"chunk":"ct in the\r\n        electronic work is discovered and reported to you within 90 days of\r\n        receipt of the work.\r\n    \r\n    • You comply with all other terms of this agreement for free\r\n        distribution of Project Gutenberg™ works.\r\n    \r\n\r\n1.E.9. If you wish to charge a fee or distribute a "},{"id":221,"chunk":"Project\r\nGutenberg™ electronic work or group of works on different terms than\r\nare set forth in this agreement, you must obtain permission in writing\r\nfrom the Project Gutenberg Literary Archive Foundation, the manager of\r\nthe Project Gutenberg™ trademark. Contact the Foundation as set\r\nforth in Sec"},{"id":222,"chunk":"tion 3 below.\r\n\r\n1.F.\r\n\r\n1.F.1. Project Gutenberg volunteers and employees expend considerable\r\neffort to identify, do copyright research on, transcribe and proofread\r\nworks not protected by U.S. copyright law in creating the Project\r\nGutenberg™ collection. Despite these efforts, Project Gutenberg™\r"},{"id":223,"chunk":"\nelectronic works, and the medium on which they may be stored, may\r\ncontain “Defects,” such as, but not limited to, incomplete, inaccurate\r\nor corrupt data, transcription errors, a copyright or other\r\nintellectual property infringement, a defective or damaged disk or\r\nother medium, a computer virus,"},{"id":224,"chunk":" or computer codes that damage or\r\ncannot be read by your equipment.\r\n\r\n1.F.2. LIMITED WARRANTY, DISCLAIMER OF DAMAGES - Except for the “Right\r\nof Replacement or Refund” described in paragraph 1.F.3, the Project\r\nGutenberg Literary Archive Foundation, the owner of the Project\r\nGutenberg™ trademark, "},{"id":225,"chunk":"and any other party distributing a Project\r\nGutenberg™ electronic work under this agreement, disclaim all\r\nliability to you for damages, costs and expenses, including legal\r\nfees. YOU AGREE THAT YOU HAVE NO REMEDIES FOR NEGLIGENCE, STRICT\r\nLIABILITY, BREACH OF WARRANTY OR BREACH OF CONTRACT EXCEPT T"},{"id":226,"chunk":"HOSE\r\nPROVIDED IN PARAGRAPH 1.F.3. YOU AGREE THAT THE FOUNDATION, THE\r\nTRADEMARK OWNER, AND ANY DISTRIBUTOR UNDER THIS AGREEMENT WILL NOT BE\r\nLIABLE TO YOU FOR ACTUAL, DIRECT, INDIRECT, CONSEQUENTIAL, PUNITIVE OR\r\nINCIDENTAL DAMAGES EVEN IF YOU GIVE NOTICE OF THE POSSIBILITY OF SUCH\r\nDAMAGE.\r\n\r\n1.F."},{"id":227,"chunk":"3. LIMITED RIGHT OF REPLACEMENT OR REFUND - If you discover a\r\ndefect in this electronic work within 90 days of receiving it, you can\r\nreceive a refund of the money (if any) you paid for it by sending a\r\nwritten explanation to the person you received the work from. If you\r\nreceived the work on a phy"},{"id":228,"chunk":"sical medium, you must return the medium\r\nwith your written explanation. The person or entity that provided you\r\nwith the defective work may elect to provide a replacement copy in\r\nlieu of a refund. If you received the work electronically, the person\r\nor entity providing it to you may choose to give"},{"id":229,"chunk":" you a second\r\nopportunity to receive the work electronically in lieu of a refund. If\r\nthe second copy is also defective, you may demand a refund in writing\r\nwithout further opportunities to fix the problem.\r\n\r\n1.F.4. Except for the limited right of replacement or refund set forth\r\nin paragraph 1.F."},{"id":230,"chunk":"3, this work is provided to you ‘AS-IS’, WITH NO\r\nOTHER WARRANTIES OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT\r\nLIMITED TO WARRANTIES OF MERCHANTABILITY OR FITNESS FOR ANY PURPOSE.\r\n\r\n1.F.5. Some states do not allow disclaimers of certain implied\r\nwarranties or the exclusion or limitation of "},{"id":231,"chunk":"certain types of\r\ndamages. If any disclaimer or limitation set forth in this agreement\r\nviolates the law of the state applicable to this agreement, the\r\nagreement shall be interpreted to make the maximum disclaimer or\r\nlimitation permitted by the applicable state law. The invalidity or\r\nunenforceabi"},{"id":232,"chunk":"lity of any provision of this agreement shall not void the\r\nremaining provisions.\r\n\r\n1.F.6. INDEMNITY - You agree to indemnify and hold the Foundation, the\r\ntrademark owner, any agent or employee of the Foundation, anyone\r\nproviding copies of Project Gutenberg™ electronic works in\r\naccordance with t"},{"id":233,"chunk":"his agreement, and any volunteers associated with the\r\nproduction, promotion and distribution of Project Gutenberg™\r\nelectronic works, harmless from all liability, costs and expenses,\r\nincluding legal fees, that arise directly or indirectly from any of\r\nthe following which you do or cause to occur: "},{"id":234,"chunk":"(a) distribution of this\r\nor any Project Gutenberg™ work, (b) alteration, modification, or\r\nadditions or deletions to any Project Gutenberg™ work, and (c) any\r\nDefect you cause.\r\n\r\nSection 2. Information about the Mission of Project Gutenberg™\r\n\r\nProject Gutenberg™ is synonymous with the free distri"},{"id":235,"chunk":"bution of\r\nelectronic works in formats readable by the widest variety of\r\ncomputers including obsolete, old, middle-aged and new computers. It\r\nexists because of the efforts of hundreds of volunteers and donations\r\nfrom people in all walks of life.\r\n\r\nVolunteers and financial support to provide volu"},{"id":236,"chunk":"nteers with the\r\nassistance they need are critical to reaching Project Gutenberg™’s\r\ngoals and ensuring that the Project Gutenberg™ collection will\r\nremain freely available for generations to come. In 2001, the Project\r\nGutenberg Literary Archive Foundation was created to provide a secure\r\nand perma"},{"id":237,"chunk":"nent future for Project Gutenberg™ and future\r\ngenerations. To learn more about the Project Gutenberg Literary\r\nArchive Foundation and how your efforts and donations can help, see\r\nSections 3 and 4 and the Foundation information page at www.gutenberg.org.\r\n\r\nSection 3. Information about the Project "},{"id":238,"chunk":"Gutenberg Literary Archive Foundation\r\n\r\nThe Project Gutenberg Literary Archive Foundation is a non-profit\r\n501(c)(3) educational corporation organized under the laws of the\r\nstate of Mississippi and granted tax exempt status by the Internal\r\nRevenue Service. The Foundation’s EIN or federal tax iden"},{"id":239,"chunk":"tification\r\nnumber is 64-6221541. Contributions to the Project Gutenberg Literary\r\nArchive Foundation are tax deductible to the full extent permitted by\r\nU.S. federal laws and your state’s laws.\r\n\r\nThe Foundation’s business office is located at 809 North 1500 West,\r\nSalt Lake City, UT 84116, (801) 5"},{"id":240,"chunk":"96-1887. Email contact links and up\r\nto date contact information can be found at the Foundation’s website\r\nand official page at www.gutenberg.org/contact\r\n\r\nSection 4. Information about Donations to the Project Gutenberg\r\nLiterary Archive Foundation\r\n\r\nProject Gutenberg™ depends upon and cannot surv"},{"id":241,"chunk":"ive without widespread\r\npublic support and donations to carry out its mission of\r\nincreasing the number of public domain and licensed works that can be\r\nfreely distributed in machine-readable form accessible by the widest\r\narray of equipment including outdated equipment. Many small donations\r\n($1 to"},{"id":242,"chunk":" $5,000) are particularly important to maintaining tax exempt\r\nstatus with the IRS.\r\n\r\nThe Foundation is committed to complying with the laws regulating\r\ncharities and charitable donations in all 50 states of the United\r\nStates. Compliance requirements are not uniform and it takes a\r\nconsiderable ef"},{"id":243,"chunk":"fort, much paperwork and many fees to meet and keep up\r\nwith these requirements. We do not solicit donations in locations\r\nwhere we have not received written confirmation of compliance. To SEND\r\nDONATIONS or determine the status of compliance for any particular state\r\nvisit www.gutenberg.org/donate."},{"id":244,"chunk":"\r\n\r\nWhile we cannot and do not solicit contributions from states where we\r\nhave not met the solicitation requirements, we know of no prohibition\r\nagainst accepting unsolicited donations from donors in such states who\r\napproach us with offers to donate.\r\n\r\nInternational donations are gratefully accep"},{"id":245,"chunk":"ted, but we cannot make\r\nany statements concerning tax treatment of donations received from\r\noutside the United States. U.S. laws alone swamp our small staff.\r\n\r\nPlease check the Project Gutenberg web pages for current donation\r\nmethods and addresses. Donations are accepted in a number of other\r\nway"},{"id":246,"chunk":"s including checks, online payments and credit card donations. To\r\ndonate, please visit: www.gutenberg.org/donate.\r\n\r\nSection 5. General Information About Project Gutenberg™ electronic works\r\n\r\nProfessor Michael S. Hart was the originator of the Project\r\nGutenberg™ concept of a library of electronic"},{"id":247,"chunk":" works that could be\r\nfreely shared with anyone. For forty years, he produced and\r\ndistributed Project Gutenberg™ eBooks with only a loose network of\r\nvolunteer support.\r\n\r\nProject Gutenberg™ eBooks are often created from several printed\r\neditions, all of which are confirmed as not protected by copy"},{"id":248,"chunk":"right in\r\nthe U.S. unless a copyright notice is included. Thus, we do not\r\nnecessarily keep eBooks in compliance with any particular paper\r\nedition.\r\n\r\nMost people start at our website which has the main PG search\r\nfacility: www.gutenberg.org.\r\n\r\nThis website includes information about Project Guten"},{"id":249,"chunk":"berg™,\r\nincluding how to make donations to the Project Gutenberg Literary\r\nArchive Foundation, how to help produce our new eBooks, and how to\r\nsubscribe to our email newsletter to hear about new eBooks.\r\n\r\n"}]